<script setup>
import {ref} from 'vue';
import router from "@/router";

const isChecked = ref(false);

// 회원가입 페이지로 이동
const moveToRegister = () => {
  router.push('/register');
}
</script>

<template>
  <div class="tos-all">

    <div class="tos-content">
      <div class="tos-title">
        <span>약관동의</span>
      </div>
      <div class="tos-info">
        <span><h1>이용 약관</h1>
                                (주)개발자랑(이하 회사)는 고객님의 개인정보를 중요시하며, "정보통신망 이용촉진 및 정보보호"에 관한 법률 및 『개인 정보 보호법』을 준수하고 있습니다. <br><br>회사는 개인정보 처리방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인 정보 보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다. <br><br>회사는 개인 정보 처리 방침을 개정하는 경우 웹사이트 공지사항(또는 개별공지)를 통하여 공지할 것입니다.
        <br>

                                제 1 장  총 칙
        <br>

                                제 2 장  서비스(e-marketplace) 이용 계약
        <br>

                                제 3 장  서비스(e-marketplace) 이용 규정
        <br>

                                제 4 장  서비스 이용 수수료
        <br>

                                제 5 장  면책 조항 등
        <br>

                                제 6 장  기타
        <br>
        <br>

                                제 1 장  총 칙
                      <br>

                                제 1 조  (목적)
                                이 약관은 (주)개발자랑(이하 “회사”라고 합니다.)가 인터넷 사이트(http://www.developer.co.kr)를 통하여 제공하는 e-marketplace서비스(이하 “서비스”라고 합니다.)의 이용과 관련하여 회사와 회원 간의 권리와 의무, 책임사항 및 회원의 서비스 이용조건 및 절차, 기타 필요한 사항을 『전자 거래 기본법』 및 『정보 통신망 이용촉진 및 정보보호 등에 관한 법률』 등 관련 법령에 의하여 규정함을 목적으로 합니다.
        <br>
        <br>

                                제 2 조  (약관의 효력 및 개정)
                                회사는 이 약관의 내용을 서비스를 이용하고자 하는 자와 회원이 쉽게 알 수 있도록 서비스가 제공되는 인터넷 사이트(http://www.developer.co.kr) 초기 화면에 게시합니다.
                                이 약관은 회사가 회원에게 회사 홈페이지(http://www.developer.co.kr), 전자우편 혹은 기타의 방법으로 공지함으로써 그 효력이 발생합니다.
                                회사는 『약관의 규제에 관한 법률』, 『정보 통신망 이용 촉진 및 정보 보호 등에 관한 법률』 등 관련법을 위배하지 않는 범위에 한하여 이 약관을 개정할 수 있습니다.
                                회사가 약관을 개정할 경우에는 개정된 약관의 적용 일자 및 개정 사유를 명시하여 그 적용일자 7일 이전부터 적용일자 전일까지 전2항과 같은 방법으로 공지하고, 공지 후 7일이 경과하는 날부터 효력을 발생시킵니다. <br><br>다만, 회원에게 불리한 약관의 개정의 경우에는 공지 외에 일정기간 전자우편, 로그인 시 동의창 등의 전자적 수단을 통해 따로 명확히 통지하도록 합니다.
                                회사가 전항에 따라 개정 약관을 공지 또는 통지하면서 회원에게 7일 내에 의사표시를 하지 않으면 의사표시가 표명된 것으로 본다는 뜻을 명확하게 공지 또는 통지하였음에도 회원이 명시적으로 거부의 의사표시를 하지 않은 경우 회원이 개정 약관에 동의한 것으로 봅니다.
                                회원이 개정약관 적용에 동의하지 않는 경우 회사는 개정 약관의 내용을 해당 회원에 한하여 적용할 수 없으며, 이 경우 해당 회원은 이용계약을 해지할 수 있습니다. <br><br>다만, 기존 약관을 적용할 수 없는 특별한 사정이 있는 경우에는 회사는 이용계약을 해지할 수 있습니다.
                                이 약관은 회사와 회원 간에 성립되는 서비스 이용계약의 기본 약정입니다. <br><br>회사는 필요한 경우 특정 서비스에 관하여 적용될 사항(이하 “개별약관”이라고 합니다.)을 정하여 미리 공지할 수 있습니다. <br><br>회원이 이러한 개별약관에 동의하고 특정 서비스를 이용하는 경우에는 개별약관이 우선적으로 적용되고, 이 약관은 보충적인 효력을 갖습니다. <br><br>개별약관의 변경에 관해서는 전2항을 준용합니다.
        <br>
        <br>

                                제 3 조  (약관의 해석 및 관련 법령․ 기타 준칙과의 관계)
                                회사는 “유료서비스” 및 “개별서비스”에 대해서는 별도의 이용약관 및 정책(이하 "유료서비스약관 등")을 둘 수 있으며, 해당 내용이 이 약관과 상충할 경우에는 "유료서비스약관 등"이 우선하여 적용됩니다.
                                이 약관에서 정하지 아니한 사항이나 해석에 대하여는 『전기 통신 사업법』, 『전자 거래 기본법』, 『전자 서명법』, 『정보 통신망 이용 촉진 및 정보 보호 등에 관한 법률』 및 『전자 거래 소비자 보호지침』 등 관련 법령의 규정과 일반 상관례에 의합니다.
                                회원은 회사가 인터넷 사이트를 통하여 제공하는 서비스를 이용할 때 『전가 거래 기본법』, 『소비자 기본법』, 『정보 통신망 이용 촉진 및 정보 보호 등에 관한 법률』 등 관계법령을 준수해야 하며, 회사가 제공하는 서비스로 회원 상호간에 이루어진 거래에 관해서는 『전자 거래 기본법』, 『전자 서명법』, 『소비자 보호법』 등 관련 법령이 우선적으로 적용되고, 회원은 이 약관의 규정을 들어 거래 상대방에 대하여 면책을 주장할 수 없습니다.
        <br>
        <br>

                                제 4 조  (용어의 정의)
                                이 약관에서 사용하는 용어의 정의는 다음과 같습니다.
                                서비스 : 회사가 인터넷사이트(http://www.developer.co.kr)를 통하여 회원들에게 제공하는 회원 간의 e-marketplace서비스 및 관련 부가서비스 일체를 말합니다.
                                일반형 서비스 : 바이어와 프리랜서를 회사가 중개하는 서비스 및 관련 부가서비스 일체를 말합니다.
                                재택(턴키) 서비스 : 바이어와 프리랜서가 직접 거래하는 서비스 및 관련 부가서비스 일체를 말합니다.
                                회원 : 회사와 서비스 이용계약을 체결한 자를 말합니다. <br><br>회원은 바이어와 프리랜서, 개인회원과 사업자 회원, 정회원과 준회원으로 구분됩니다.
                                회원 아이디(ID) : 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고, 회사가 승인하여 회사에 등록된 문자와 숫자의 조합을 말합니다.
                                비밀번호(Password) : 회원의 동일성 확인과 회원의 개인정보, 권익 및 비밀 등의 보호를 위하여 회원 스스로가 설정하여 회사에 등록한 문자와 숫자의 조합을 말합니다.
                                운영자 : 회사가 회원들에게 제공하는 서비스 일체에 대한 전반적인 관리와 원활한 운영을 위하여 회사에서 선정한 자를 말합니다.
                                해지 : 회사 또는 회원이 서비스를 제공 또는 이용하기 시작한 후, 서비스 이용 계약을 종료 시키는 행위를 말합니다.
                                입찰 : 회원이 회사가 제공하는 서비스를 통하여 프로젝트를 수행할 의사를 표시하거나, 회사가 제공하는 부가 서비스를 구매할 의사로 원하는 가격을 제시하는 행위를 말합니다.
                                낙찰 : 회원이 입찰에 의하여 프로젝트를 수행하게 되거나, 부가 서비스를 구매할 수 있게 되어 거래가 성립되는 것을 말합니다.
                                개인 회원 : 회사가 제공하는 서비스에 가입한 회원 중에서 사업자 회원이 아닌 자를 말합니다.
                                사업자 회원 : 회사가 제공하는 서비스에 가입한 회원 중에서 사업자 등록증을 보유한 개인사업자 및 법인 사업자를 말합니다. <br><br>(사업자 회원은 이하 “기업 회원”이라고 합니다.)
                                바이어 : 회사의 서비스를 통하여 프로젝트를 진행할 의사를 표시하고, 회사가 온라인으로 제공하는 양식에 맞춰 프로젝트의 등록 또는 인력의 구인을 의뢰하는 개인회원 또는 기업회원을 말합니다.
                                프리랜서 : 회사의 서비스를 통하여 회사에 등록된 프로젝트를 수행할 의사로 입찰한 개인회원 또는 기업회원과 구직을 의뢰하는 개인회원을 말합니다.
                                정회원 : 회사가 제공하는 서비스에 가입한 회원 중에서 이력서(경력 기술서) 또는 프로젝트를 등록한 회원을 말합니다.
                                준회원 : 회사가 제공하는 서비스에 가입한 회원을 말합니다.
                                매매 보호 장치 : 회사가 프리랜서 서비스를 통한 거래의 안전을 위하여 프로젝트 대금의 입,출금을 중개할 목적으로 마련한 절차를 말합니다.

        <br>
        <br>

                                제 2 장  서비스(e-marketplace) 이용계약
                              <br>

                                제 5 조 (서비스 이용계약의 성립)
                                서비스 이용계약(이하 “이용계약”이라 합니다.)은 회사의 서비스를 이용하고자 하는 자의 이용 신청(회원 가입 신청)에 대하여 회사가 승낙(회원 가입 성공) 함으로써 성립합니다. <br><br>회사는 24시간 이내에 승낙된 회원이 회원 본인의 아이디와 패스워드를 입력하여 회사 홈페이지(http://www.developer.co.kr)를 통한 서비스를 사용할 수 있도록 합니다.
                                회사는 원칙적으로 회원의 이용신청에 대해 서비스 이용을 승낙합니다. <br><br>다만, 회사는 다음 각 호에 해당하는 신청에 대하여는 승낙을 하지 않거나 사후에 이용 계약을 해지할 수 있습니다.
                                1. <br><br>가입신청자가 이 약관에 의하여 이전에 회원자격을 상실한 적이 있는 경우,
                                다만, 회원자격 상실 후 1년이 경과한 자로서 회사의 회원 재가입 승낙을 얻은 경우에는 예외로 함.
                                2. <br><br>실명이 아니거나 타인의 명의를 이용한 경우
                                3. <br><br>허위의 정보를 기재하거나, 회사가 제시하는 내용을 기재하지 않은 경우
                                4. <br><br>이용자의 귀책사유로 인하여 승인이 불가능하거나 기타 규정한 제반 사항을 위반하며 신청하는 경우
                                5. <br><br>기타 위법한 이용신청임이 확인된 경우
                                제 1항에 따른 신청에 있어 회사는 회원의 종류에 따라 전문기관을 통한 실명확인 및 본인인증을 요청할 수 있습니다.
                                회사는 서비스 제공 관련 설비의 여유가 없거나, 기술상 또는 업무상 문제가 있는 경우에는 승낙을 유보할 수 있습니다.
                                제2항과 제4항에 따라 회원 가입 신청의 승낙을 하지 아니하거나 유보한 경우, 회사는 원칙적으로 이를 이용신청자에게 전자우편을 통하여 알리도록 합니다.
                                이용계약의 성립 시기는 회사가 가입완료를 신청절차 상에서 표시한 시점으로 합니다.
                                회사는 회원에 대해 회사정책에 따라 정회원, 준회원 등 등급별로 구분하여 서비스 이용에 차등을 둘 수 있습니다.
        <br>
<br>
                                제 6 조 (이용신청)
                                서비스를 이용하고자 하는 자는 다음 사항을 회사가 온라인으로 제공하는 가입신청양식에 정확하고, 사실과 다름이 없이 기록해야만 회사 홈페이지(http://www.developer.co.kr)내의 다양한 서비스를 원활하게 제공받으실 수 있습니다.
                                1. <br><br>회원아이디(ID)
                                2. <br><br>비밀번호(Password)
                                3. <br><br>이름(실명) - 바이어 회원의 경우 업체명 / 대표이사(대표자)명 / 담당자명
                                4. <br><br>주민등록번호 - 바이어의 경우 법인등록번호, 사업자등록번호
                                5. <br><br>E-mail 주소
                                6. <br><br>전화번호 - 휴대폰. <br><br>자택. <br><br>사무실
                                7. <br><br>주소 - 자택. <br><br>사무실
                                이용 신청자가 회원으로 등록하기 위해서는 이 약관의 내용과 이 약관이 회사의 서비스 이용 계약의 일부가 됨을 동의하여야 합니다.
                                프로젝트 매매와 관련된 서비스를 이용하고자 하는 회원은 전1항의 제1호에서 7호까지 필수사항을 입력해야 합니다. <br><br>회사는 프로젝트 거래의 안전을 담보하기 위하여 전1항 제1호에서 제7호까지의 사항 중 기재되지 않은 사항이 있을 경우, 해당 회원에 대하여 이용 신청의 해지. <br><br>유보 또는 탈퇴 처리를 할 수 있습니다.
                                    <br>
<br>
                                제 7 조 (이용계약의 종료)
                                이용계약은 회원 해지 요청 또는 이 약관의 규정에 따른 회사의 해지에 의해 즉시 종료됩니다.
                                회원에 의한 해지
                                회원은 언제든지 회사에게 해지 의사를 통지함으로써 이용 계약을 해지할 수 있습니다. <br><br>다만, 회원은 해지 의사를 통지하기 전에 모든 입찰 및 등록한 프로젝트를 철회 또는 취소해야만 합니다. <br><br>이 경우, 입찰의 취소 또는 철회로 인해 회원 본인에게 발생한 불이익에 대한 책임은 회원 본인에게 있습니다.
                                회원은 우편(서면). <br><br>모사전송(FAX). <br><br>전자우편의 방법으로 해지 의사를 통지할 수 있습니다. <br><br>이 경우 회사는 회원에 대하여 그 동일성을 확인하기 위해 회원 아이디(ID), 비밀번호(Password) 및 주민등록번호(법인등록번호. <br><br>사업자등록번호)의 확인을 요청할 수 있으며, 회원은 이에 응하여야 합니다.
                                회원이 이용계약을 해지한 경우, 이용계약은 해지의사가 회사에 도달한 때에 종료됩니다. <br><br>다만, 회원이 프로젝트에 대한 입찰 또는 서비스 등록을 통하여 관련된 프로젝트가 진행중인 경우에는 해당 프로젝트가 완료된 이후에 이용계약이 종료됩니다.
                                회원의 의사로 해지를 한 경우에는 재이용 의사가 회사에 통지된 익일부터 서비스의 재이용이 가능합니다.
                                회사에 의한 해지 또는 이용정지
                                회사는 다음 각 목의 사유가 발생하거나 확인된 경우 이용계약을 해지할 수 있습니다.
                                가. <br><br>고의로 불법적인 프로젝트 또는 서비스를 판매등록하거나 기타 공공질서 및 미풍양속에 위배되는 행위를 하거나 이를 시도한 경우
                                나. <br><br>회사나 다른 회원, 기타 타인의 권리나 명예, 신용 기타 정당한 이익을 침해하는 행위를 한 경우
                                다. <br><br>회사가 제공하는 개발자랑서비스의 원활한 진행을 방해하는 행위를 하거나 이를 시도한 경우
                                라. <br><br>제 13조 제 2항에 해당하는 허위등록을 한 경우 또는 이를 알고 프로젝트 또는 서비스를 이용한 것으로 판단되는 경우
                                전1호의 경우, 회사는 회원에게 우편(서면). <br><br>모사전송(FAX). <br><br>전자우편의 방법으로 해지사유를 통지하고 해지의사를 밝힙니다. <br><br>다만, 이 경우 회사는 회원에게 해지사유에 대한 의견진술의 기회를 부여합니다.
                                이용계약은 회사의 해지 의사를 회원에게 통지한 시점에 종료됩니다. <br><br>회사의 의사에 의하여 회사와 회원 간의 이용계약이 종료된 경우, 회원이 재이용 신청을 하더라도 재이용 여부는 이 약관 제5조의 각 규정에 의하여 결정됩니다.
                                회사는 이용계약의 종료로 인한 손해 또는 손실에 대하여 일체의 책임을 지지 않습니다.
                                제 3항 제1호 라목의 경우 회사는 해당 프로젝트 또는 서비스를 임의로 취소할 수 있습니다.
                                회사는 이용계약의 종료로 인한 손해 또는 손실에 대하여 일체의 책임을 지지 않습니다.
                                제 3항 제1호 라목의 경우 회사는 해당 프로젝트 또는 서비스를 임의로 취소할 수 있습니다.

        <br>
<br>
                                제 3 장  서비스(e-marketplace) 이용규정
                                제 8 조 (서비스의 이용 및 회원아이디의 관리)
                                회원은 회원 아이디(ID)와 비밀번호, 주민등록번호를 통하여 언제든지 회사가 제공하는 서비스에 접속할 수 있고, 자유롭게 회사의 서비스를 이용하여 프로젝트 또는 서비스를 판매하거나 구매. <br><br>이용할 수 있습니다.
                                회원은 회원 아이디 및 비밀번호를 스스로의 책임 아래 관리하여야 합니다. <br><br>회원은 회원 아이디 및 비밀번호를 타인에게 양도하거나 사용 승낙할 수 없으며, 회사는 회원 본인에 의한 회원 아이디 또는 비밀번호의 유출 및 사용승낙으로 인한 어떠한 손실이나 손해에 대하여 책임을 지지 않습니다. <br><br>만약 회원이 회원 아이디 또는 비밀번호를 도난 당하거나 제3자가 사용하고 있음을 인지한 경우, 곧바로 회사에게 통보하여야 하고 회사의 안내가 있을 때 그에 따라야 합니다.
                                회원은 회사가 제공하는 서비스를 통하여 프로젝트를 수행하는 경우, 회사가 마련한 매매보호장치를 적용하여 거래를 완료할 수 있습니다.
                                회사는 회원 간의 직거래 및 이중 계약으로 인하여 발생한 문제에 대하여 책임지지 않습니다. <br><br>단, 회사가 인정한 범위내에서는 매매 보호 장치를 적용하지 않으며, 매매 보호 장치의 적용여부는 계약체결시 계약서에 기재한 바와 같이 함을 원칙으로 합니다.
                  <br>
<br>
          제 9 조 (개인정보의 변경. <br><br>보호)
                                이용 신청자 또는 회원은 이용신청 시 기재한 사항이 변경되었을 경우에는 즉시 회원 본인이 관련사항을 수정하여야 합니다. <br><br>단, 회원 아이디(ID), 주민등록번호 및 성명은 수정할 수 없습니다.
                                전 1항에도 불구하고 회원 본인이 수정하지 않은 정보로 인한 각종 손해는 해당 회원 본인에게 그 책임이 있으며, 회사는 이에 대하여 아무런 책임을 지지 않습니다.
                                회사는 서비스 화면을 통하여 공개된 정보를 제외하고는 회원의 개인 정보를 회사가 제공하는 서비스 및 서비스의 기능 확대 외의 용도로 사용하거나 회원의 동의 없이 제3자에게 제공하지 않습니다. <br><br>단, 법령에서 정보의 공개를 요구하거나 법령에 의하여 정보의 제공이 가능한 경우에는 예외로 하고 입찰을 통한 계약이 성사된 경우에는 쌍방 당사자 간에 프로젝트와 관련된 상호정보를 교환할 수 있습니다. <br><br>회사가 회원으로부터 개인정보의 제공에 관하여 동의를 받아야 하는 경우, 정보 제공 관련 사항(제공받는 자, 제공목적, 제공정보의 내용)을 미리 명시하거나 고지하며 회원은 일단 개인정보의 제공에 동의하더라도 언제든지 그 동의를 철회할 수 있습니다.
                                회사의 개인 정보 관리 책임자는 송상권(e-biz 사업부 : dev@developer.co.kr )입니다. <br><br>회원은 언제든지 자신의 개인정보를 열람할 수 있고 회사 또는 정보 관리 책임자에게 잘못된 정보의 정정을 요청할 수 있습니다. <br><br>회사는 회원으로부터 정보 정정의 요청이 있는 경우, 그 오류가 시정될 때까지 당해 개인정보를 이용하지 않습니다.
                                회사는 회원의 개인정보 보호를 위하여 관리자를 최소한으로 한정하며 회사의 고의 또는 과실로 인하여 신용카드, 은행 계좌 등을 포함한 회원의 개인 정보의 분실, 도난, 유출, 변조 등으로 야기된 회원의 손해에 대하여는 모든 책임을 부담합니다.
                                회사 또는 회사로부터 개인정보를 제공받은 제3자는 개인 정보의 수집 목적이나 제공 받은 목적을 달성한 때에는 당해 개인 정보를 지체 없이 파기합니다.
        <br>
<br>
                                제 10 조 (프로젝트의 종류)
                                회사가 제공하는 서비스는 프로젝트 등록, 서비스 등록, 입찰, 교육 콘텐츠 제공 등이 있습니다. <br><br>단, 회사가 제공하는 서비스의 내용은 회사 사정에 따라 변경될 수 있습니다.
                                회사는 프로젝트 또는 서비스의 종류에 따라 각 프로젝트 또는 서비스의 특성, 입찰 절차 및 수락 혹은 낙찰 방법에 대한 사항을 서비스 화면을 통하여 공지하며, 회원은 회사가 공지한 각 사항을 이해하고 서비스를 이용함에 동의합니다.
<br>
          <br>
          제 11 조 (프로젝트 등록에 관한 규정)
                                회사가 제공하는 서비스를 통하여 프로젝트를 진행하고자 하는 바이어 회원은 회사가 제공하는 등록 양식에 따라 프로젝트를 의뢰하여야 합니다. <br><br>프로젝트 의뢰 양식은 서비스 화면상의 프로젝트 의뢰 항목을 클릭하면 나타납니다.
                                회사가 정하는 양식에 어긋난 등록이나 허위 등록으로 인한 손해 또는 손실에 대한 책임은 등록한 바이어 회원이 부담해야 합니다.
                                프로젝트 의뢰방법
                                프로젝트 의뢰 방법은 서비스 화면상의 Tip이나 묻고 답하기 도움말에 있는 내용을 참고합니다.
                                프로젝트의 상세정보에는 사실에 입각하여 상세하게 기재하여야 하며, 거짓정보를 기재한 것이 밝혀지면 즉시 등록이 취소되며 이로 인한 책임은 등록한 바이어 회원이 부담해야 합니다.
                                프로젝트 의뢰 시 바이어 회원이 프로젝트 내용을 기재할 경우, 프로젝트 명을 선택하면 해당 내용을 볼 수 있습니다.
                                프로젝트 의뢰하여 등록된 후에는 이미 기술된 상세정보 및 입찰기간, 시작 가격의 수정은 불가능합니다. <br><br>따라서 변경사항(대금 결제 방법에 관한 변경을 포함합니다.)이 있는 경우에는 등록을 취소하고 재등록해야 합니다.
                                프로젝트 의뢰를 하는 자가 판매 또는 용역의 제공을 업으로 하는 사업자인 경우에는 상호명과 대표자 성명, 영업소 소재지, 전화번호, 팩스번호, 전자우편 주소, 사업자 등록 번호, 영업신고필증과 기타 영업 관련 자격을 명시하여야 합니다.
                                프로젝트 및 서비스 제한 규정
                                프로젝트 또는 서비스 등록 불가 종류
                                회원은 불법복제 포르노제작 등과 기타 사회의 공공질서 및 풍기 문란을 일으킬 수 있는 프로젝트를 등록할 수 없습니다. <br><br>회사는 이러한 프로젝트 또는 서비스가 등록된 경우 불법행위를 방지하고 선량한 풍속 기타 사회질서의 유지를 위하여 임의로 그 등록을 삭제할 수 있고, 이미 프로젝트 수행이 이루어진 경우에도 그 거래를 중개하지 않을 수 있습니다.
                                프로젝트 입찰 및 수행과정 및 매매보호장치
                                바이어 회원은 서비스 화면을 통해 프로젝트의 내용을 성실히 기록해야 합니다.
                                바이어 회원은 프리랜서 회원이 입찰 취소를 요청하는 경우 및 입찰 가격이 부당하거나 기타 허위 입찰로 판단되는 경우 해당 프리랜서 회원의 입찰을 취소할 수 있습니다.
                                입찰은 프로젝트 또는 서비스 등록 시 지정한 마감일시까지 진행됩니다.
                                다만, 바이어 회원이 마감일시 전에 프로젝트를 수행할 프리랜서 회원을 선정한 경우 조기 마감될 수 있습니다.
                                바이어 회원이 부득이한 사정으로 인하여 프로젝트를 취소하고자 하는 경우, 입찰 마감 전까지 취소사유를 밝혀 취소할 수 있습니다.
                                입찰 마감 이후 회사는 입,출금만을 중개합니다. <br><br>따라서 바이어 회원은 프로젝트 수행에 따르는 제반 관련한 사항을 프리랜서 회원과 협의하여 진행해야 합니다.
                                바이어 회원과 프리랜서 회원은 제13조에 규정된 회사의 매매보호장치인 에스크로 제도를 사용하여 프로젝트를 진행할 수 있습니다.
        <br>
<br>
                                제 12 조 (서비스 및 프로젝트 사용에 관한 규정)
                                프로젝트 또는 서비스를 등록하고자 하는 회원은 회사의 서비스 화면에서 입찰하여야 합니다. <br><br>입찰에 대하여는 수수료가 부과되지 않습니다. <br><br>만 19세 미만의 회원은 담배, 주류 등 청소년 보호법에서 금지하는 재화 및 용역에 관한 프로젝트 또는 서비스를 등록하여서는 안 됩니다.
                                프로젝트 등록 및 입찰과정 - 일반형 서비스
                                바이어 회원이 프로젝트 또는 서비스의 등록을 하고자 할 경우, 프로젝트나 서비스를 자세히 살펴본 후 이용 혹은 등록의사가 있을 때만 해야 합니다.
                                회원은 서비스화면을 통해 바이어 또는 프리랜서 회원의 신용도를 조회할 수도 있습니다.
                                바이어 회원은 입찰마감 전 언제든지 입찰한 프리랜서 회원 현황을 확인할 수 있으며, 프로젝트를 수행할 프리랜서 회원을 선정을 할 수 있습니다.
                                프리랜서 회원은 지정된 입찰 마감일시까지 여러 번 입찰할 수 있으나, 연속적인 중복입찰은 허용되지 않습니다.
                                입찰가격은 현재가에서 선정된 최저가 이상의 금액부터 자유롭게 책정할 수 있습니다.
                                바이어 회원은 입찰에 참가한 프리랜서 회원 이외에 회사 담당자를 통하여 프로젝트를 수행할 프리랜서 회원을 추천 받을 수 있습니다.
                                바이어 회원은 입찰에 참가한 프리랜서 회원 및 회사 담당자를 통하여 추천 받은 프리랜서 회원에 대하여 서류전형, 면접전형 등의 합격, 불합격 여부와 합격, 불합격 사유를 회사측에 고지하여야 합니다.
                                바이어 회원은 프리랜서 회원을 선정한 후에는 제13조 회사의 매매 보호 장치인 에스크로 제도의 도입여부를 상호 협의하여야 하며, 에스크로 제도를 도입하지 않을 경우에는 바이어 회원과 프리랜서 회원 및 회사가 상호 협의하여 프로젝트 총 비용에 대한 입금일시, 입금방법 등의 입금정보를 결정합니다. <br><br>이때, 바이어 회원과 프리랜서 회원은 입금방법, 입금은행, 입금자명, 입금일시 등 입금정보를 전화, 이메일 혹은 서비스 화면에 기입해야 하며, 이를 잘못 기입하거나 기입하지 않음으로 인하여 발생하는 손해에 대해서는 회사는 책임지지 않습니다.
                                회사는 바이어 회원과 프리랜서 회원이 상호 협의하여 지정한 입금일시와 입금방법 등에 따라 바이어 회원의 입금 또는 대금결제를 위해 필요한 정보를 확인하며, 바이어 회원으로부터 프로젝트 대금이 입금되면 즉시 프리랜서에게 입금현황을 통지하고, 바이어 회원이 입금한 후 3영업일 이내에 프리랜서 회원에게 중개수수료 및 제세공과금을 제외한 프로젝트 대금을 입금합니다.
                                프로젝트 등록 및 입찰과정 - 재택(턴키) 서비스
                                바이어 회원이 프로젝트 또는 서비스의 등록을 하고자 할 경우, 프로젝트나 서비스를 자세히 살펴본 후 이용 혹은 등록의사가 있을 때만 해야 합니다.
                                회원은 서비스 화면을 통해 바이어 또는 프리랜서 회원의 신용도를 조회할 수도 있습니다.
                                바이어 회원은 입찰마감 전 언제든지 입찰한 프리랜서 회원 현황을 확인할 수 있으며, 프로젝트를 수행할 프리랜서 회원을 선정을 할 수 있습니다.
                                프리랜서 회원은 지정된 입찰 마감일시까지 여러 번 입찰할 수 있으나, 연속적인 중복 입찰은 허용되지 않습니다.
                                입찰가격은 현재가에서 선정된 최저가 이상의 금액부터 자유롭게 책정할 수 있습니다.
                                바이어 회원과 프리랜서 회원은 회사에서 제공하는 채팅 등의 수단을 사용하여 프로젝트 수행에 대한 각종 사항을 협의 및 공유할 수 있습니다. <br><br>채팅방에 있는 모든 내용은 안전한 거래를 위하여 회사가 열람할 수 있습니다. <br><br>회원 간의 분쟁 발생 시, 회사는 관련 기록을 관련 수사 기관 등에 공유할 수 있습니다.
                                바이어 회원은 입찰에 참가한 프리랜서에 대하여 서류전형, 면접전형 등의 합격, 불합격 여부와 합격, 불합격 사유를 고지해야 합니다.
                                바이어 회원은 프리랜서 회원을 선정한 후에는 제13조 회사의 매매 보호 장치인 에스크로 제도를 이용하여야 합니다. <br><br>이때, 바이어 회원과 프리랜서 회원은 입금방법, 입금은행, 입금자명, 입금일시 등 입금정보를 전화, 이메일 혹은 서비스 화면에 기입해야 하며, 이를 잘못 기입하거나 기입하지 않음으로 인하여 발생하는 손해에 대해서는 회사는 책임지지 않습니다.
                                바이어 회원과 프리랜서 회원은 상호 합의하여 프로젝트 프로젝트 대금, 프로젝트 대금의 입금일시 등을 결정할 수 있습니다. <br><br>다만, 본 약관의 제 13 조에서 정의한 절차를 따라야 합니다.
        <br>
<br>
                                제 13 조 (매매보호장치)
                                회사의 서비스를 통하여 이루어지는 프로젝트 또는 서비스 거래에 관한 결제 과정 및 반품처리 과정을 위하여 매매 보호 장치인 에스크로 제도를 실행하고 있으며, 바이어 회원과 프리랜서 회원은 상호 협의하여 에스크로 제도를 도입할 수 있습니다.
                                에스크로 제도의 기능 및 목적은 아래와 같습니다.
                                1. <br><br>바이어 회원이 프리랜서 회원으로부터 공급받은 프로젝트 성과물에 대한 하자 문제 등의 담보
                                2. <br><br>프리랜서 회원이 프로젝트 성과물을 바이어 회원에게 제공하고도 그에 대한 대금을 받지 못할 경우의 담보
                                에스크로 제도의 절차 - 일반형 서비스의 경우
                                에스크로 제도의 절차는 바이어 회원이 프로젝트 대금을 회사에 선지급하고, 바이어 회원이 프리랜서 회원으로부터 프로젝트 최종 성과물이나 중간 성과물을 정상적으로 인도받은 즉시 회사에 지급 확인서를 교부하면 회사는 지급 확인서를 교부 받은 즉시 3일 이내에 바이어 회원이 프리랜서에게 지급하기로 한 일자에 프로젝트 대금을 프리랜서 회원에게 지급합니다.
                                에스크로 제도의 예치금 제도는 바이어 회원과 프리랜서 회원이 협의하여 총 프로젝트 비용의 30%에 해당하는 금액을 회사가 예치 (분할 지급할 경우에는 분할 지급액의 30%에 해당하는 금액을 계속 예치)하고 있다가 프로젝트 종료 이후 바이어 회원이 검수 기간 내에 검수를 종료하고, 검수 확인서를 회사에 교부할 경우나 검수 확정 기일이 도래할 경우에는 회사는 3일 이내에 예치금 중에서 총 프로젝트 비용의 20%에 해당하는 금액을 프리랜서 회원에게 지급하며, 총 프로젝트 비용의 10%에 해당하는 마지막 예치금은 1개월의 무상 하자 보증 기간이 도래함과 동시에 프리랜서 회원에게 지급하는 제도입니다.
                                무상 하자 보증 기간이 1개월 이상일 경우 회사가 프리랜서 회원에게 총 프로젝트 비용의 10%에 해당하는 최종적인 예치금을 지급하였더라도 도래하지 않는 무상하자 보증기간 동안의 하자보수를 특별한 사유 없이 게을리하여 그 책임을 다 하지 못할 경우에는 하자보수보증보험적 성격을 가진 총 프로젝트 비용의 10%에 해당하는 금액을 프리랜서 회원이 바이어 회원에게 반환하여야 합니다.
                                에스크로 제도 도입 시, 3개월 이상의 중, 장기 프로젝트로 프리랜서 회원이 바이어 회원의 본점 소재지 및 바이어 회원의 프로젝트 진행지에서 상주로 프로젝트를 진행하면서 프로젝트 대금을 매월 정산하기로 바이어 회원과 프리랜서 회원이 합의한 경우에는 1회차 프로젝트 대금 결산 시에 회사가 바이어 회원으로부터 지급 확인서를 교부 받으면 예치금 30%를 공제한 금액을 지급하며, 2회차 프로젝트 대금 결산 시에 회사가 바이어 회원으로부터 지급확인서를 교부 받으면 전월(1회차) 예치금 중에서 전월 지급액의 20%에 해당하는 금액과 2회차 프로젝트 대금 지급액 중 30%의 예치금을 제외한 금액을 지급하며, 프로젝트가 종료되어 바이어 회원이 검수 및 지급 확인서를 회사에 교부하면 마지막차 지급일 때에는 마지막차 지급액 중 10%에 해당하는 금액만을 예치하고, 전월 지급 금액 중 20%에 해당하는 금액과 함께 지급하며, 최종적으로 적립되어 있는 총 프로젝트 비용 중 10%에 해당하는 금액은 3개월의 무상하자보증기간이 종료됨과 동시에 프리랜서 회원에게 지급하는 제도입니다.
                                매매보호장치인 에스크로 제도에 따른 프로젝트 또는 서비스의 제공 결과로 회사가 취득하게 되는 이자 등의 이익은 서비스 제공의 대가로서의 성질을 가지는 것이며, 바이어 회원과 프리랜서 회원은 이러한 이자 등에 대한 권리를 주장하지 않습니다. <br><br>또한, 송금 시 발생하는 수수료에 대해서는 회원 본인이 부담하는 것으로 이를 회사에 청구할 수 없습니다.
                                에스크로 제도의 절차 - 재택(턴키) 서비스의 경우
                                에스크로 제도의 절차는 바이어 회원이 계약 체결과 동시에 프로젝트 대금을 회사에 선지급하고, 바이어 회원이 프리랜서 회원으로부터 프로젝트 최종 성과물이나 중간 성과물을 정상적으로 인도받은 즉시 회사에 지급을 요청하면 회사는 지급 요청을 받은 날로부터 15일 이내에 대금을 프리랜서 회원에게 지급합니다.
                                에스크로 제도의 예치금 제도는 바이어 회원과 프리랜서 회원이 합의한 프로젝트 대금을 회사가 예치하고 있다가 프로젝트 종료 이후 바이어 회원이 검수 기간 내에 검수를 종료하고, 바이어가 회사에 지급을 요청한 날로부터 15일 이내에 회사가 프로젝트 대금을 프리랜서에게 지급하는 제도입니다.
                                계약기간 종료 여부와 무관하게 바이어가 회사에 프로젝트 지급 요청이 없을 경우, 회사는 프로젝트 대금을 지급하지 않습니다.
                                회사가 회사에 예치한 프로젝트 대금을 환불을 요청할 경우, 계약 당사자인 프리랜서가 서면 또는 본인의 의사를 표시할 수 있는 수단으로 회사에 환불을 승인할 경우에 회사는 프로젝트 대금을 바이어에게 환불합니다.
                                매매보호장치인 에스크로 제도에 따른 프로젝트 또는 서비스의 제공 결과로 회사가 취득하게 되는 이자 등의 이익은 서비스 제공의 대가로서의 성질을 가지는 것이며, 바이어 회원과 프리랜서 회원은 이러한 이자 등에 대한 권리를 주장하지 않습니다. <br><br>또한, 송금 또는 타 금융기관을 통한 에스크로 서비스 이용 시 발생하는 수수료에 대해서는 회원 본인이 부담하는 것으로 이를 회사에 청구할 수 없습니다.
        <br>
<br>
                                제 14 조 (평가기간)
                                “평가기간”이라 함은 프로젝트 최종 낙찰자인 프리랜서 회원이 프로젝트를 진행함에 있어서 적합한 개발 능력이 있는 지의 여부를 판단하는 기간을 말합니다. <br><br>이 평가 기간 이후에 대한 책임은 프리랜서 회원의 특별한 귀책사유가 없는 한 바이어 회원에게 있는 것으로 추정합니다.
                                평가기간의 기능(목적)은 다음과 같습니다.
                                1. <br><br>평가기간 동안에 바이어 회원이 프로젝트 진행에 있어서 프리랜서 회원이 적합한 개발 능력이 있는 지의 여부를 판단하고, 이에 적합하지 않다고 판단되어질 때 회사에게 다른 인력의 추천을 요구하여 프로젝트가 원만하게 진행할 수 있도록 하기 위한 기능
                                2. <br><br>평가기간 이후에 프로젝트 의뢰자인 바이어 회원이 프로젝트 수주자인 프리랜서 회원의 개발 능력 부족 등을 이유로 프로젝트 대금을 지급하지 않음을 방지하기 위한 기능
                                바이어 회원과 프리랜서 회원은 신의성실의 원칙에 입각하여 프로젝트 기간, 프로젝트 내용 등을 종합적으로 판단하여 상호 협의하여 평가 기간을 정하며, 그 기간 동안의 프로젝트 대금은 프로젝트의 진행 정도, 프로젝트에 투입된 일수 등을 종합적으로 판단하여 회사의 중개 수수료를 포함하여 기 지급하기로 약정했던 금원의 50% 이상으로 합니다. <br><br>단, 프로젝트 성격상 평가기간이 필요 없는 경우에는 그러하지 않습니다.

        <br>
<br>
                                제 4 장  서비스 이용 수수료<br>
                                제 15 조 (수수료)
                                회사가 부과하는 수수료는 서비스 수수료, 정규직 채용 수수료, 글로벌 프리랜서 이용료를 말합니다.
                                서비스 수수료는 프로젝트 성사에 관한 중개 수수료를 말합니다. <br><br>중개 수수료는 프로젝트 총액의 7% 이상으로, 회사와 바이어 회원. <br><br>프리랜서 회원이 상호 협의하여 그 지급 방법 등에 대하여 정합니다.
                                정규직 채용 수수료는 프로젝트 진행 시 정규직으로 채용할 경우의 수수료를 말합니다. <br><br>수수료의 금액은 연봉의 9% 이상으로, 바이어 회원이 프리랜서 회원을 정규직으로 채용 후 회사가 요구하는 계좌로 현금 입금하는 것을 원칙으로 합니다.
                                글로벌 프리랜서 이용료는 전세계적으로 이용하는 프리랜서 서비스를 말하며 회사가 글로벌의 developerglobal.com (http://www.developerglobal.com)와 개발자랑 중국 (http://www.developer.com.cn, http://www.developer.cn)와 개발자랑 재팬 (http://www.developerjapan.co.jp, http://www.developer.jp) 등 제휴한 사이트 등을 말합니다. <br><br>이를 이용할 때 번역과 법률 및 세무관련 자문을 대행해주는 대가로 6개월에 일금 삼십 만원 정(￦300,000. <br><br>-VAT별도)을 받습니다. <br><br>바이어 회원과 프리랜서 회원 중에서 이 서비스를 필요로 하는 회원들은 서비스 화면에 등록하고 회사가 정한 은행의 계좌에 입금해야 합니다.
                                서비스 수수료인 중개 수수료는 프로젝트 대금이 회사를 경유하여 프리랜서 회원에게 지급될 경우 및 에스크로 제도를 이용할 경우에는 회사는 프로젝트 대금의 송금 시에 위 수수료를 공제한 잔액을 송금합니다.
                                원천징수
                                회사를 통하여 프로젝트 진행을 의뢰 또는 수행하는 모든 회원은 납세의 의무를 가집니다.
                                바이어 회원 또는 프리랜서 회원 중 개인회원은 소득세 3.3%가 부과되며, 사업자 회원은 10%의 부가가치세가 부과됩니다.
                                회사는 개인 회원에 대하여 세무 서비스의 일환으로 소득세 3.3%를 원천징수하여 수납을 대행합니다. <br><br>따라서 바이어 회원 또는 프리랜서 회원 중 개인회원은 편리하게 납세의 의무를 다할 수 있으며, 회사의 원천징수 서비스를 이용하지 않아 개인회원에게 발생하는 모든 책임은 개인회원 본인에게 있습니다.
                                서비스 수수료 지급
                                회사는 프리랜서 회원에게 프로젝트 대금을 송금할 시, 상기 기재된 프로젝트 중개에 대한 서비스 수수료 및 원천징수세 3.3%를 공제한 잔액을 지급하는 것을 원칙으로 합니다.
        <br>
<br>
                                제 16 조 (서비스 수수료 지급 의무)
                                서비스 수수료의 지급은 제15조 제2항의 규정에 의하여 총 프로젝트의 7% 이상에 해당하는 금액을 정하는 것을 원칙으로 합니다.
                                프로젝트 진행 중에 프로젝트가 중단될 경우에는 아래에 따라 수수료를 지급합니다.
                                1. <br><br>바이어 회원의 고의, 과실로 인하여 프로젝트가 중단될 경우에는 바이어 회원이 회사에 대한 수수료를 부담합니다.
                                2. <br><br>프리랜서 회원의 고의, 과실로 인하여 프로젝트가 중단될 경우에는 프리랜서 회원이 서비스수수료를 부담합니다.
                                제 2항의 경우에 회사는 바이어 회원과 프리랜서 회원이 상호 협의하여 그 중개수수료 금액을 정할 수 있습니다.

        <br>
<br>
                                제 5 장  면책조항 등<br>
                                제 17 조 (대리 및 보증의 부인)
                                회사는 프로젝트 또는 서비스를 판매하거나 구매하고자 하는 회원을 대리할 권한을 갖고 있지 않으며, 회사의 어떠한 행위도 바이어 회원 또는 프리랜서 회원의 대리행위로 간주되지 않습니다.
                                회사는 서비스를 통하여 이루어지는 회원 간의 프로젝트 또는 서비스의 사용 및 구매와 관련하여 판매의사 또는 구매의사의 진정성, 등록 물품의 존재나 완전성, 안전성, 적법성 및 타인의 권리에 대한 비침해성, 회원이 입력하는 정보 및 그 정보를 통하여 링크된 URL에 게재된 자료의 진실성 등 일체에 대하여 보증하지 않습니다.
        <br>
<br>
                                제 18 조 (회사의 면책)
                                회사는 회사가 제공하는 서비스 자체와 관련이 없는 서비스를 통한 프로젝트 또는 서비스거래와 관련하여 회원에게 발생한 손해에 대하여는 책임을 지지 않습니다.
                                회사는 천재지변 또는 이에 준하는 불가항력, 정보통신설비의 보수점검·교체 및 고장, 통신의 두절 등으로 인하여 일시적 또는 종국적으로 서비스를 제공할 수 없는 경우에는 서비스 제공에 관한 책임이 면제됩니다. <br><br>이 경우 회사는 약관 제 2조에 정한 방법으로 회원들에게 통지합니다.
                                회사는 인터넷 이용자 또는 회원의 귀책 사유로 인한 서비스 이용의 장애에 대하여 책임을 지지 않습니다.
                                회사는 회원이 서비스를 통하여 기대하는 손익이나 서비스를 통하여 얻은 자료로 인한 손해에 관하여 책임을 지지 않습니다.
                                회사는, 바이어 회원과 프리랜서 회원을 중개해 주는 역할을 수행합니다. <br><br>회사에 의해 체결되는 계약의 직접 당사자는 바이어 회원과 프리랜서 회원으로서, 회사는 바이어 회원 및 프리랜서 회원의 거래에 대한 책임은 지지 않습니다. <br><br>이는 당사자들 간의 계약으로 이로 인해 발생하는 모든 문제는 양당사자가 직접 해결함을 원칙으로 하고 회사에 중재 컨설팅 또는 소송진행 관련 컨설팅을 요청할 경우 건당 일금 일십만 오만원정(￦150,000. <br><br>-VAT별도)의 비용을 회사에 지급하고 바이어 회원과 프리랜서 회원은 각각 당사로부터 컨설팅 서비스를 받으실 수 있습니다. <br><br>(단, 컨설팅을 의뢰하시는 내용에 따라 컨설팅 비용은 변경될 수 있습니다.)
                                회원이 게재한 정보, 자료, 사실의 정확성 등을 신뢰함으로써 입은 손해에 대하여 회사는 책임을 지지 않습니다.

        <br>

                                제 6 장 기타<br>
                                제 19 조 (관할법원)
                                회사가 제공하는 서비스와 관련하여 회사와 회원 사이에 발생한 분쟁에 대해 소송이 제기될 경우 그 관할법원은 합의 관할 법원으로 하며, 합의 관할 법원을 협의하지 않았을 경우에는 민사 소송법에 의합니다.
        <br><br>
                                제 20 조 (기타)
                                회사는 회원이 제기하는 정당한 의견이나 불만을 반영하고 그 문제를 해결하고 회원 상호간의 분쟁을 조정하기 위하여 회사 법무팀 소속의 이의 처리 조정 기구(lawmanager@developer.co.kr)를 설치·운영합니다. <br><br>회사는 회원으로부터 제기되는 불만사항 및 의견을 우선적으로 처리하며, 처리가 지연될 경우 그 사유와 처리기간을 통보합니다.
                                본 서비스 약관을 위반하거나 서비스 이용 시 불편 사항이 생기면 주식회사 프리랜서의 고객센터를 이용하시거나 전화(02-545-0042) 알려주시면 성심껏 처리해드리겠습니다.
                                회사소개
                                주식회사 (주)개발자랑
                                사업자 등록번호 : 010-110-2763
                                소재지 : 뭘봐요 나가요
                                대표이사 : 임채륜

        <br>

                                부칙
        <br>

                                제 1 조 (개정 및 시행일 등)
                                본 약관의 개정일은 2019년 08월 31일입니다.
                                본 약관의 시행일은 2019년 09월 01일이며, 7일 동안 홈페이지에 공지한 후에 2019년 09월 07일부터 그 효력이 발생됩니다.

<br>
                                부칙
<br>
                                제 1 조 (개정 및 시행일 등)
                                본 약관의 개정일은 2023년 08월 04일입니다.
                                본 약관의 시행일은 2023년 08월 05일이며, 7일 동안 회사 홈페이지(http://www.developer.co.kr)에서 공지한 후에 2023년 08월 12일부터 그 효력이 발생됩니다.</span>
      </div>
      <div class="agree-box">
        <div class="check-box">
          <label>
            <span class="point-text">*(필수) &nbsp;</span>
            <input type="checkbox" class="agree-check" v-model="isChecked">
            <span class="agree-text">동의</span>
          </label>
        </div>
        <button class="next" :disabled="!isChecked" @click="moveToRegister">다음</button>
      </div>
    </div>
  </div>
</template>

<style scoped>
  .tos-all {
    width: 100%;
    height: 768px;

  }
  .tos-content{
    width: 650px;
    margin: 45px auto;
    text-align: center;
  }

  .tos-title span{
    font-size: 30px;
    color: #3257B5;
  }
  .tos-info{
    margin-top: 30px;
    height: 400px;
    border: 2px solid #617CC2;
    border-radius: 10px;
    text-align: left;
    overflow: scroll;
    padding-top: 15px;
  }
  .tos-info span{
    margin-left: 10px;
  }
  .check-box{
    text-align: right;
  }
  .check-box .point-text{
    color: #FF5353;
  }
  .check-box .agree-text{
    margin-right: 20px;
  }
  .next{
    font-size: 18px;
    color: white;
    background-color: #617CC2;
    border: none;
    width: 110px;
    height: 40px;
    border-radius: 10px;
    cursor: pointer;
  }
  /* 비활성화 상태 스타일 */
  .next:disabled {
    background-color: #D9D9D9;
    color: white;
    cursor: not-allowed;
  }
  .tos-info{
    padding: 30px;
    line-height: 25px;
  }


</style>